docs/api.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-15 五 17:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>c api</title>
<meta name="generator" content="Org mode">
<meta name="author" content="DreamAndDead">
<link id="theme" rel="stylesheet" type="text/css" href="htmlize.css">
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="content">
<h1 class="title">c api</h1>
<p>
c api 和 vm 是一样的
</p>

<p>
都是在操作 lua<sub>State</sub>
</p>

<p>
不过一个是 opcode interface，一个是 c func 接口
</p>

<p>
这样就保证了和谐的与 c 语言集成的状态。
</p>

<p>
lua 代码不过是 c api 的一种符号表示
</p>


<p>
不仅外部使用，也提供给内部使用
</p>





<p>
c api 是一个宽广的范畴
</p>

<p>
getallocf
</p>

<p>
dump  load
</p>

<p>
call pcall error
</p>

<p>
gc
</p>

<p>
metatable
</p>


<p>
fenv
</p>

<p>
newstate
</p>


<p>
newthread resume xmove yield status
</p>


<p>
getupvalue
</p>


<p>
和各个模块相关，api 只是一层接口
</p>



<p>
只了解 api.c 和 stack 相关的内容
</p>


<div id="outline-container-org1fde561" class="outline-2">
<h2 id="org1fde561"><span class="section-number-2">1</span> category</h2>
<div class="outline-text-2" id="text-1">
<p>
lua.h:117
</p>

<p>
lauxlib.c
</p>


<p>
func and macro
</p>


<p>
basic mani
</p>

<ul class="org-ul">
<li>xmove, in coroutine</li>
</ul>

<p>
access stack -&gt; C
</p>




<p>
push C -&gt; stack
</p>




<p>
get lua -&gt; stack
</p>

<p>
set stack -&gt; lua
</p>





<p>
lua &lt;-&gt; stack
</p>

<p>
stack internal manipulation
</p>










<p>
lua call c means
</p>

<p>
a cclosure in lua stack and lua<sub>precall</sub> call it
</p>

<p>
how cclosure mani L stack and return value is what
base on the rules
</p>



<p>
typedef int (*lua<sub>CFunction</sub>) (lua<sub>State</sub> *L);
</p>

<p>
c closure protocol
</p>
</div>
</div>

<div id="outline-container-org34dc9db" class="outline-2">
<h2 id="org34dc9db"><span class="section-number-2">2</span> index</h2>
<div class="outline-text-2" id="text-2">
<p>
idx2addr
</p>

<ul class="org-ul">
<li>-</li>
</ul>


<p>
Pseudo-Indices??
</p>


<p>
The thread environment (where global variables live) is always at pseudo-index LUA<sub>GLOBALSINDEX</sub>. The environment of the running C function is always at pseudo-index LUA<sub>ENVIRONINDEX</sub>. 
</p>


<p>
regisTRYINDEX??
</p>


<p>
lua.h:33
</p>
</div>
</div>



<div id="outline-container-orgce9ed95" class="outline-2">
<h2 id="orgce9ed95"><span class="section-number-2">3</span> api list</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://www.lua.org/manual/5.1/manual.html#3">lua 5.1 ref</a>
</p>
</div>
</div>


<div id="outline-container-org4b042dd" class="outline-2">
<h2 id="org4b042dd"><span class="section-number-2">4</span> c closure?</h2>
</div>



<div id="outline-container-orged5b58b" class="outline-2">
<h2 id="orged5b58b"><span class="section-number-2">5</span> how to connect c with lua</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>compile with lua
<ul class="org-ul">
<li>lua as lib</li>
<li>c as lib，maybe registry</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p>Updated: 2021-01-15 五 17:48</p>
<p>Created: 2021-01-15 五 17:48</p>
<p>Author: DreamAndDead</p>
<p>Email: <a href="mailto:dreamanddead@foxmail.com">dreamanddead@foxmail.com</a></p>
<script src="https://utteranc.es/client.js" repo="DreamAndDead/DreamAndDead.github.io" issue-term="pathname" label="Comment" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
